#Напишите рекурсивную функцию для возведения числа a в степень b. 
#Разрешается использовать только операцию умножения. 
#Циклы использовать нельзя

#Примеры/Тесты:
#<function_name>(2,0) -> 1
#<function_name>(2,1) -> 2
#<function_name>(2,3) -> 8
#<function_name>(2,4) -> 16



def num (x,y):
    if y == 0:
        return 1       
    else:
        return x * num(x,y-1)

print (num(2,3))